[PrototypeShield X2AbilityTemplate]
LocFriendlyName="防护壁障"
LocLongDescription="猎户座太空服有一个实验性的能量屏障，给予使用者6点的护盾值。"
LocHelpText="猎户座太空服有一个实验性的能量屏障，给予使用者6点的护盾值。"
LocFlyOverText="防护壁障"

[OrionSmoke X2AbilityTemplate]
LocFriendlyName="烟雾弹"
LocLongDescription="士兵可以立即释放一团烟雾，在紧急情况下提供额外的防御。"
LocHelpText="每任务两次，给予该士兵一个不消耗行动点的即时防御烟圈。"
LocFlyOverText="烟雾弹"

[MjolnirShield X2AbilityTemplate]
LocFriendlyName="能量护盾"
LocLongDescription="雷神之锤战斗服采用了变种人护盾技术，为用户提供12点生命的护盾，每回合恢复3点生命。"
LocHelpText="雷神之锤战斗服采用了变种人护盾技术，为用户提供12点生命的护盾，每回合恢复3点生命。"
LocFlyOverText="能量护盾"

[OverextendShield X2AbilityTemplate]
LocFriendlyName="增强延展盾"
LocLongDescription="每任务两次，使你的发电机过载，并给予附近所有盟友6点护盾，持续3回合。"
LocHelpText="每次任务两次，消耗1个行动点，给予附近所有盟军6点护盾，持续3回合。"
LocFlyOverText="增强延展盾"

[SuperheavyPlatedArmor X2ArmorTemplate]
FriendlyName="猎户座战斗服"
FriendlyNamePlural="猎户座战斗服"
BriefSummary="这种超重型装甲结合了增强护盾支架和动力外骨骼，与捕食者装甲相比提供了更好的保护和抗伤害能力。也配备了一个小型可回收能量盾。"
TacticalText="<Bullet/> 猎户座战斗服作为一种超重型装甲系统，可以承受巨大的伤害。\n<Bullet/>在需要的时候，战斗服可以发出一股烟雾，提供紧急掩护。\n<Bullet/>战斗服有一个小型的护盾发生器，但我们不知道如何在战场上补充能量。"

[SuperheavyPoweredArmor X2ArmorTemplate]
FriendlyName="雷神之锤战斗服"
FriendlyNamePlural="雷神之锤战斗服s"
BriefSummary="这种超重型装甲提供了巨大的伤害抵抗力和生存能力，以及变种人护盾技术。有循环再生护盾。"
TacticalText="<Bullet/> 雷神之锤战斗服是我们最强大的设计，给我们的士兵带来难以置信的可持续性。\n<Bullet/>雷神之锤战斗服提供了一个大型护盾，可以每回合恢复到原来的强度。\n<Bullet/>盾牌也可以暂时过载，为附近的盟友提供一个小盾牌。"

[OrionSuit X2TechTemplate]
DisplayName="猎户座战斗服"
Summary="受变种人新型“护盾者”盔甲的启发，我们首次尝试打造一套完全致力于生存能力的防护服，应该会让部队无比高兴。我们甚至成功地研究了一些新的能源屏障技术。"
CodeName="到达"
LongDescription="我一直在研究基于变种人护盾的各种超重型装甲原型，这至少应该为我们的部队在长期战斗中经受一些严重的惩罚提供一种手段。此外，这套装备还包含了一个小型的、不用充电的护盾架“能量护盾”版本。莉莉·沈。"

[MjolnirSuit X2TechTemplate]
DisplayName="雷神之锤战斗服"
Summary="在“仙女座”生物令人难以置信的耐久套装被修复，以及对元素物质的广泛研究之后，我们相信我们已经完全破解了变种人单位使用的能量护盾的再生能力。"
CodeName="斯巴达II型"
LongDescription="由于我们无法制造更多的元素，我一直在犹豫是否建议我们将一些有限的供应承诺给这样一个资源密集型项目。然而，随着最近在外星力场研究方面的突破，我相信我们的超重型“猎户座”装甲的更新版是强大的。我希望这种盔甲能让你带来更好的消息，指挥官。莉莉·沈。"
